app/common/models/UserCollect.php

SELECT * FROM `ks_user_collect` WHERE (`user_id`=1) AND (`subject_id`=1)
---
    public static function hasCollect($id, $intSubjectId, $intUserId = null)
    {
        $isReturn = false;
        if ($intUserId || ! Yii::$app->user->isGuest) {
            $collect = self::findOne([
                'user_id' => $intUserId ? $intUserId : Yii::$app->user->id,
                'subject_id' => $intSubjectId
            ]);