app/backend/controllers/Controller.php

SELECT * FROM `ks_admin` WHERE `status`=1
---
    public function beforeAction($action)
    {
        // 主控制器验证
        if ( ! parent::beforeAction($action)) {return false;}

        // 验证权限
        if( ! Yii::$app->user->can($action->controller->id . '/' . $action->id) && Yii::$app->getErrorHandler()->exception === null) {
            // 没有权限AJAX返回
            if (Yii::$app->request->isAjax)
                exit(Json::encode(['errCode' => 216, 'errMsg' => '对不起，您现在还没获得该操作的权限!', 'data' => []]));
            else
                throw new UnauthorizedHttpException('对不起，您现在还没获得该操作的权限!');
        }

        // 处理提前获取数据
        if ( ! in_array($action->id, ['insert', 'update', 'delete'])) {
            // 查询导航栏信息
            $menus = Yii::$app->cache->get('navigation'.Yii::$app->user->id);
            if ($menus) {
                Menu::setNavigation();  // 生成缓存导航栏文件
                $menus = Yii::$app->cache->get('navigation'.Yii::$app->user->id);
            }

            // 没有权限
            if ( ! $menus) throw new UnauthorizedHttpException('对不起，您还没获得显示导航栏目权限!');

            // 查询后台管理员信息
            $this->admins = ArrayHelper::map(Admin::findAll(['status' => 1]), 'id', 'username');