app/backend/controllers/QuestionController.php

    public function actionIndex()
    {
        // 获取数据
        $subject = Subject::find()->all();
        $special = Special::find()->where(['!=', 'pid', 0])->orderBy('sort')->all();
        $chapter = Chapter::find()->orderBy('sort')->all();
---
SELECT * FROM `ks_subject`
SELECT * FROM `ks_special` WHERE `pid` != 0 ORDER BY `sort`
SELECT * FROM `ks_chapter` ORDER BY `sort`

    public function actionChild($id)
    {
        $answer = Answer::findAll(['qid' => $id]);
---
SELECT * FROM `ks_answer` WHERE `qid`='1319'