app/frontend/controllers/SiteController.php

SELECT * FROM `ks_subject` WHERE `name`='科目一'
SELECT * FROM `ks_special` WHERE `name`='难题'
---
    public function actionIndex()
    {
        // 查询科目一
        $subject = Subject::findOne(['name' => '科目一']);
        if (!$subject) $subject = Subject::findOne(1);
        // 查询难题
        $special = Special::findOne(['name' => '难题']);